% Змоделювати приклад елементарного нейрона

% Кількість точок даних
N = 265;
t = 0:N-1;

% Сигнали
x1(1:N) = 0.7;              % Постійний сигнал 0.7
x2 = 2*t/N-1;               % Лінійне зростання сигналу від -1 до 1
x3 = sin(2*pi*3.0*t/N);     % Сінусоідальний сигнал з частотою 3
x4 = (2*(t/N).^2)-1;        % Параболічний сигнал від -1 до 1
x5 = (2*rand(1, N)-1)*0.6;  % Шумовий сигнал від -0.6 до 0.6

% початковий стан
a0 = 0;

% Вагові коефіцієнти
a1 = 0.2;
a2 = 0.3;
a3 = 0.4;
a4 = 0.2;
a5 = 0.1;
 
% Зважена сума сигналов ( Формальний нейрон )
S = a0 + a1*x1 + a2*x2 + a3*x3 + a4*x4 + a5*x5;

% Порогова функція
V_porog=zeros(1, N);
for k = 1:N
    if S(k) < 0
        V_porog(k) = -1;
    end
    if S(k) >= 0
        V_porog(k) = 1;
    end
end

% Сигмоїдна функція
V_sig=zeros(1, N);
for k = 1:N
    sig = (1 - exp(-S(k))) ./ (1 + exp(-S(k)));
    V_sig(k) = sig;
    if sig <= -1
        V_sig(k) = -1;
    elseif sig >= 1
        V_sig(k) = 1;
    end
end

% Лінійна функція активації
V_lin=zeros(1, N);
for k = 1:N
    V_lin(k) = S(k);
    if S(k) <= -1
        V_lin(k) = -1;
    elseif S(k) >= 1
        V_lin(k) = 1;
    end
end

% Ступенева функція активації
V_pow=zeros(1, N);
for k = 1:N
    pow = S(k).^3;
    V_pow(k) = pow;
    if pow <= -1
        V_pow(k) = -1;
    elseif pow >= 1
        V_pow(k) = 1;
    end
end

% Графік для зваженої суми сигналов S
plot(t,S);
grid();
title('Зважена сума сигналов');

% Графік сигнлалов
figure;
plot(t,x1, t,x2, t,x3, t,x4, t,x5);
ylim([-1.2, 1.2]);
grid();
title('Сигнали нейрона');
legend( ...
    'Постійний сигнал', ...
    'Лінійний сигнал', ...
    'Сінусоїдальний сигнал', ...
    'Параболічний сигнал', ...
    'Шумовий сигнал');

% Графік функцій активації
figure;
plot(t, V_porog, t, V_sig, t, V_lin, t, V_pow);
ylim([-1.2, 1.2]);
grid();
title('Функції активації');
legend( ...
    'Порогова функція', ...
    'Сигмоїдна функція', ...
    'Лінійна функція', ...
    'Ступенева функція');

