% Варіант 4
A=[1:4;5:8;9,9,8,7;6,5,4,3];
B=[-15,7; 2,1];
C=[1,-3,5,7];
D=[8,11,2,9];

% Задання 1
disp('Задання 1');
A0=inv(A);
B0=inv(B);

summ_A_A0=A+A0
diff_B_B0=B-B0

% Задання 2
disp('Задання 2');
CT=C';
DT=D';

mult_CT_D=CT*D
mult_C_DT=C*DT

% Задання 3
disp('Задання 3');
eig_A=eig(A)
det_B=det(B)

% Задання 4
disp('Задання 4');
E=eye(4);
Z=zeros(2, 6);
F=[A E; Z B]

% Задання 5
disp('Задання 5');
F1=F(1:2,:)

% Задання 6
disp('Задання 6');
F2=F(:,end-1: end)

% Задання 7
disp('Задання 7');
F3=F(1:2,end-2:end)

% Задання 8
disp('Задання 8');
F4=F;
F4(1,:)=0

% Задання 9
disp('Задання 9');
F5=F;
F5(:,1)=0
