% Завантаження зображення
load woman;

% Вибираємо рядок
Y = X(20, :);   % Рядок зображення 
N = length(Y);  % Кількість елементів у рядку

% Ініціалізація масивів для коефіцієнтів
a = zeros(1, N);    % Коефіцієнти a_n
b = zeros(1, N);    % Коефіцієнти b_n

% Ініціалізація масивів для амплітуди та фази
A = zeros(1, N);        % Амплітуди
phi = zeros(1, N);      % Фази

% Обчислюємо коефіцієнти тригонометричного ряду
for n = 1:N     % Номер гармоники
    k = 1:N;    % Індекси елементів
    a(n) = sum(Y(k) .* cos(2 * pi * n * k / N)) / N;
    b(n) = sum(Y(k) .* sin(2 * pi * n * k / N)) / N;

    % Амплітудний спектр
    A(n) = sqrt(a(n).^2 + b(n).^2);

    % Фазовий спектр
    phi(n) = atan2(b(n), a(n));
end

% Відновлення сигналу з ряду Фур'є (для кожної точки)
T = zeros(1, N);
for k = 1:N
    n = 1:N; % Індекси коефіцієнтов
    T(k)=sum(a(n) .* cos(2 * pi * n * k / N) + b(n) .* sin(2 * pi * n * k / N));
end

% Побудова графіків спектральних діаграм
t = 1:N;    % Ось X Частота (гармоника)

% График амплітудно-частотного спектра (АЧС)
close all;
subplot(2,1,1);
bar(t, A);
title('Амплітудно-частотний спектр (АЧС)');
xlabel('Частота (гармоника)');
ylabel('Амплітуда');

% Графік фазо-частотного спектра (ФЧС)
subplot(2,1,2);
bar(t, phi);
title('Фазо-частотний спектр (ФЧС)');
xlabel('Частота (гармоника)')
ylabel('Фаза');

% Оригінальний сигнал
figure;
subplot(2,1,1);
plot(t, Y);
title('Оригінальний сигнал');
xlabel('Індекс');
ylabel('Y');

% Відновлений сигнал
subplot(2,1,2);
plot(t, T);
title('Відновлений сигнал');
xlabel('Індекс');
ylabel('T');

% Зображення
figure;
Y1=Y;
Y1(2, :)=Y(1,:);
Y1(3, :)=Y(1,:);
subplot(2,1,1);
imshow(Y1, map);
title('Оригінальне зображення');

subplot(2,1,2);
T1 = T;
T1(2, :)=T(1,:);
T1(3, :)=T(1,:);
imshow(T1, map);
title('Відновлене зображення');
