% Початок вимірювання часу виконання скрипта.
tic;

% Визначаємо кількість точок сигналу.
N = 64;

% Створюємо вектор часу.
t = 0:N-1;

% Гармонічний сигнал ( оригінальний сигнал )
y0 = cos(2*pi*0.5*t/N);

% Додаємо до сигнала шум
y = y0 + 0.2*randn(1,N);

% Вектор X
X = polyfit(t,y,3);

% Поліном
P = polyval(X,t);

% Стандартне відхилення між оригінальним сигналом і зашумленим
std_y = std(y0 - y)

% Стандартне відхилення між оригінальним сигналом і поліномом
std_P = std(y0 - P)

% Побудова графіків
% зашумлений сигнал (y),
% оригінальний сигнал (y0),
% Поліном (P).
plot(t, y, t, y0, t, P);

% Додавання легенди для графіків
legend('Зашумлений сигнал (y)', 'Оригінальний сигнал (y0)', 'Поліном (P)');

% Сітка
grid();

% Завершення вимірювання часу виконання скрипта.
time = toc
