% Початок вимірювання часу виконання скрипта.
tic;

% Визначаємо кількість точок сигналу.
N = 64;

% Створюємо вектор часу.
t = 0:N-1;

% Гармонічний сигнал ( оригінальний сигнал )
y0 = cos(2*pi*0.5*t/N);

% Додаємо до сигнала шум
y = y0 + 0.2*randn(1,N);

% Створюємо матрицю M для полінома четвертого степеня
M = [sum(t.^8), sum(t.^7), sum(t.^6), sum(t.^5), sum(t.^4);
     sum(t.^7), sum(t.^6), sum(t.^5), sum(t.^4), sum(t.^3);
     sum(t.^6), sum(t.^5), sum(t.^4), sum(t.^3), sum(t.^2);
     sum(t.^5), sum(t.^4), sum(t.^3), sum(t.^2), sum(t.^1);
     sum(t.^4), sum(t.^3), sum(t.^2), sum(t.^1), sum(t.^0)];

% Вектор Y ( множники для полінома )
Y = [sum(y.*t.^4);
     sum(y.*t.^3);
     sum(y.*t.^2);
     sum(y.*t.^1);
     sum(y.*t.^0)];

% Обернена матриця ( Розв'язок системи лінійних рівнянь, коефіцієнти полінома )
X = M^(-1)*Y;

% Поліном четвертого ступеня
P = X(1)*t.^4 + X(2)*t.^3 + X(3)*t.^2 + X(4)*t + X(5);

% Стандартне відхилення між оригінальним сигналом і зашумленим
std_y = std(y0 - y)

% Стандартне відхилення між оригінальним сигналом і поліномом
std_P = std(y0 - P)

% Побудова графіків
% зашумлений сигнал (y),
% оригінальний сигнал (y0),
% Поліном (P).
plot(t, y, t, y0, t, P);

% Додавання легенди для графіків
legend('Зашумлений сигнал (y)', 'Оригінальний сигнал (y0)', 'Поліном (P)');

% Сітка
grid();

% Завершення вимірювання часу виконання скрипта.
time = toc
