% Модель розпізнавання символів
% "Д", "Е", "Н", "І"

% Вхідні символи
% Для того, щоб кодувати ці літери, ми вибираємо сітку розміром 5x6 (30 елементів),
% -1 - чорний
% 1 - білий
X = [
    % Літера "Д" (для імітації нерозв'язної ситуації)
    % [1, 1, 1, 1, -1, 1, 1, -1, -1, 1, -1, 1, 1, 1, -1, 1, 1, -1, 1, 1, 1, -1, -1, -1, -1, -1, -1, -1, -1, -1];
    % Літера "Е" (для імітації нерозв'язної ситуації)
    % [1, 1, 1, 1, -1, 1, 1, -1, -1, 1, -1, 1, 1, 1, -1, 1, 1, -1, 1, 1, 1, -1, -1, -1, -1, -1, -1, -1, -1, -1];
    % Літера "Д"
    [1, 1, 1, 1, -1, 1, 1, -1, -1, 1, -1, 1, 1, 1, -1, 1, 1, -1, 1, 1, 1, -1, -1, -1, -1, -1, -1, -1, -1, -1];
    % Літера "Е"
    [1, 1, 1, 1, -1, 1, 1, -1, -1, -1, -1, 1, 1, 1, -1, 1, 1, 1, -1, 1, -1, 1, 1, 1, 1, -1, -1, -1, -1, -1];
    % Літера "Н"
    [1, -1, 1, 1, -1, 1, 1, 1, 1, 1, 1, -1, 1, 1, -1, 1, 1, -1, 1, -1, 1, -1, 1, -1, 1, 1, 1, -1, -1, 1];
    % Літера "І"
    [1, 1, -1, -1, 1, -1, 1, 1, 1, -1, 1, -1, 1, -1, -1, 1, 1, 1, 1, -1, 1, -1, 1, 1, -1, 1, -1, -1, -1, 1];
];

% Вихідні вектори для кожної букви
Y = [
    [1, -1, -1, -1];  % Вихід для букви "Д"
    [-1, 1, -1, -1];  % Вихід для букви "Е"
    [-1, -1, 1, -1];  % Вихід для букви "Н"
    [-1, -1, -1, 1];  % Вихід для букви "І"
];

input = size(X, 2);    % Кількість рецепторних нейронів (вхідних нейронів)
output = size(Y, 2);   % Кількість вихідних нейронів

weights = zeros(input, output);    % Ініціалізація ваг (вектори нульові)

iteration = 0;      % Ініціалізація лічильника ітерацій
max_iteration = 5;  % Максимальна кількість ітерацій
while iteration < max_iteration
    is_all_equal = true;  % Прапорець для перевірки, чи всі виходи рівні

    % Проходження по всім вхідним зображенням
    for i = 1:size(X, 1)
        x = X(i, :);      % Вхідний вектор для поточної букви
        y = Y(i, :);      % Вихідний вектор для поточної букви

        func_output = sign(x * weights);  % Обчислення виходу нейронної мережі

        % Перевірка, чи вихід відрізняється від очікуваного
        if ~isequal(func_output, y)
            is_all_equal = false;

            % Проходження по всім вихідним нейронам
            for j = 1:output
                % Оновлення ваг за правилом Хебба
                weights(:, j) = weights(:, j) + x' * y(j);
            end
        end
    end

    % Якщо всі виходи рівні, зупиняємо навчання
    if is_all_equal
        break;
    end

     % Збільшення лічильника ітерацій
    iteration = iteration + 1;
end

% Вивід результатів
disp('Остаточні ваги:');
disp(weights);

% Тестування
for i = 1:size(X, 1)
    x = X(i, :);
    func_output = sign(x * weights);
    
    disp(['Распознанная буква ', num2str(i), ':']);
    disp(func_output);
end

if iteration == max_iteration
    disp("Неможливо адаптувати ваги. Проблема нерозв'язна.");
end
